//==================================================================================================================
// 
// メイン[main.h]
// Author : Seiya Takahashi
// 
//==================================================================================================================
#ifndef _MAIN_H_
#define _MAIN_H_

//==================================================================================================================
// 警告対処用
//==================================================================================================================
#define _CRT_SECURE_NO_WARNINGS
#define DIRECTINPUT_VERSION (0x0800)

//==================================================================================================================
// インクルードファイル
//==================================================================================================================
#include <stdio.h>
#include<Windows.h>
#include"d3dx9.h"
#include "dinput.h"
#include "xaudio2.h"
#include <iostream>
using namespace std;

//==================================================================================================================
// ライブラリのリンク
//==================================================================================================================
#pragma comment(lib,"d3d9.lib")					// 描画処理に必要
#pragma comment(lib,"d3dx9.lib")				// [d3d9.lib]の拡張ライブラリ
#pragma comment(lib,"dxguid.lib")				// DirectXコンポーネント（部品）使用に必要
#pragma comment(lib,"winmm.lib")				// システム時間取得に必要
#pragma comment(lib,"dinput8.lib")				// 入力に必要

//==================================================================================================================
// マクロ定義
//==================================================================================================================
#define SCREEN_WIDTH	(1280)					// ウィンドウの幅
#define SCREEN_HEIGHT	(720)					// ウィンドウの高さ

// 2Dポリゴン頂点フォーマット
#define FVF_VERTEX_2D (D3DFVF_XYZRHW|D3DFVF_DIFFUSE | D3DFVF_TEX1)

// 3Dポリゴン頂点フォーマット
#define FVF_VERTEX_3D (D3DFVF_XYZ | D3DFVF_NORMAL | D3DFVF_DIFFUSE | D3DFVF_TEX1)

// 2Dポリゴン頂点フォーマットに合わせた構造体を定義
typedef struct
{
	D3DXVECTOR3 pos;	// 頂点座標
	float		rhw;	// 1.0で固定、同次座標
	D3DCOLOR	col;	// 頂点カラー
	D3DXVECTOR2 tex;	// テクスチャ座標
} VERTEX_2D;

// Dポリゴン頂点フォーマット合わせた構造体を定義
typedef struct
{
	D3DXVECTOR3 pos;	// 頂点座標
	D3DXVECTOR3 nor;	// 法線ベクトル
	D3DCOLOR col;		// 頂点カラー
	D3DXVECTOR2 tex;	// テクスチャ座標
} VERTEX_3D;

int GetFPS(void);		// FPSの取得

#endif