//==================================================================================================================
//
// メッシュスフィア[meshSphere.h]
// Author : Seiya Takahashi
//
//==================================================================================================================
#ifndef _MESHSPHERE_H_
#define _MESHSPHERE_H_

//==================================================================================================================
// インクルードファイル
//==================================================================================================================
#include "main.h"
#include "scene.h"

//==================================================================================================================
// マクロ定義
//==================================================================================================================
#define SKY_TEXTUE "data/TEXTURE/SkyTexture.jpg"		// 読み込むテクスチャのソース先

//==================================================================================================================
// 前方宣言
//==================================================================================================================
class CMeshSphere;

//==================================================================================================================
//
// メッシュフィールドクラスの定義
//
//==================================================================================================================
class CMeshSphere : public CScene
{
public:
	CMeshSphere(PRIORITY type);				// コンストラクタ
	~CMeshSphere();							// デストラクタ
	void Init(void);						// 初期化処理
	void Uninit(void);						// 終了処理
	void Update(void);						// 更新処理
	void Draw(void);						// 描画処理

	static CMeshSphere *Create(void);		// 生成処理
	static HRESULT Load(void);				// テクスチャ情報ロード
	static void Unload(void);				// テクスチャ情報アンロード

	void SetPos(D3DXVECTOR3 pos);			// 位置設定処理

protected:

private:
	static LPDIRECT3DTEXTURE9 m_pTexture;	// テクスチャへのポインタ
	static CMeshSphere *m_pMeshShere;		// メッシュ球の情報ポインタ

	LPDIRECT3DVERTEXBUFFER9 m_pVtxBuff;		// バッファ
	LPDIRECT3DINDEXBUFFER9 m_pIdxBuff;		// インデックスバッファへのポインタ
	VERTEX_3D *m_pVtx;						// 頂点格納
	D3DXMATRIX m_mtxWorld;					// ワールドマトリックス

	D3DXVECTOR3 m_pos;						// 位置
	D3DXVECTOR3 m_vector;					// ベクトル
	D3DXVECTOR3 m_Nor;						// 法線

	int m_nNumVertex;						// 総頂点数
	int m_nNumIndex;						// 総インデックス数
	int m_nNumPolygon;						// 総ポリゴン数
};
#endif