//==================================================================================================================
//
// 数字クラス[number.h]
// Author : Seiya Takahashi
//
//==================================================================================================================
#ifndef _NUMBER_H
#define _NUMBER_H

//==================================================================================================================
// インクルードファイル
//==================================================================================================================
#include "main.h"
#include "Scene2D.h"

//==================================================================================================================
// マクロ定義
//==================================================================================================================
#define NUMBER_SIZE_X 33					// 数字の大きさX
#define NUMBER_SIZE_Y 60					// 数字の大きさY

//==================================================================================================================
// 前方宣言
//==================================================================================================================
class CScene2D;

//==================================================================================================================
//
// 数字クラスの定義
//
//==================================================================================================================
class CNumber
{
public:
	CNumber();														// コンストラクタ
	~CNumber();														// デストラクタ
	void Init(void);												// 初期化処理
	void Uninit(void);												// 終了処理
	void Update(void);												// 更新処理
	void Draw(void);												// 描画処理

	static CNumber *CreateObject(void);								// 生成処理
	static HRESULT Load(void);										// テクスチャ情報ロード
	static void Unload(void);										// テクスチャ情報アンロード

	void SetNumber(int nNumber);									// 数字設定
	void SetPos(D3DXVECTOR3 pos, float fSizeX, float fSizeY);		// 位置設定

protected:

private:
	static LPDIRECT3DTEXTURE9 m_pTexture;							// テクスチャ情報
	static D3DXVECTOR3 m_pos;										// 位置

	LPDIRECT3DVERTEXBUFFER9 m_pVtxBuff;								// 頂点バッファ
};
#endif
